{
  "introText": "M.Sc. in Robotics, Cognition and Intelligence at the Technical University of Munich. I work at the intersection of 3D computer vision, geometry, and multimodal language models for clinical and medical AI. My thesis, \"Emotion-Driven Editing of GaussianAvatars\", supervised by Prof. Matthias Niessner, combined multi-view 3D FLAME tracking, 2D diffusion-guided supervision, and tile based differentiable rendering to add realistic, fine grained facial expressions to neutral 3D head avatars, including wrinkles and subtle skin tone changes.\n\nI focus on reliability in medical imaging and image guided therapy, with interests in uncertainty and calibration, interpretability, data efficient learning, and evaluation under distribution shift. I build with PyTorch and modern 3D pipelines such as Gaussian Splatting and NeRF style models, and I care about clean, reproducible research tooling. Outside work I enjoy Coldplay and learning languages.",
  "introText_DE": "M.Sc. in Robotics, Cognition and Intelligence an der Technischen Universität München. Ich arbeite an der Schnittstelle von 3D Computer Vision, Geometrieverfahren und multimodalen Sprachmodellen für klinische und medizinische KI. Meine Masterarbeit \"Emotion-Driven Editing of GaussianAvatars\", betreut von Prof. Matthias Niessner, kombinierte mehransichtliches 3D FLAME Tracking, diffusionsgestützte Supervision in 2D und kachelbasiertes differentielles Rendering, um neutralen 3D Kopf Avataren realistische und fein abgestufte Gesichtsausdrücke zu verleihen, darunter Falten und subtile Änderungen des Hauttons.\n\nMir ist Verlässlichkeit in der medizinischen Bildgebung und in der bildgestützten Therapie wichtig, mit Interessen in Unsicherheit und Kalibrierung, Interpretierbarkeit, dateneffizientem Lernen und Evaluation unter Verteilungsverschiebung. Technisch arbeite ich mit PyTorch und modernen 3D Pipelines wie Gaussian Splatting und Modellen nach dem NeRF Prinzip, und ich lege Wert auf saubere und reproduzierbare Forschungswerkzeuge. Abseits der Arbeit höre ich gern Coldplay und lerne Sprachen."
}
