[
  { "title": "Multimodal Features for 3D Point Cloud Anomaly Detection", "team" : "Abhinav Utkarsh, Matthias Pouleau , Malaz Tamim, Sayak Dutta" ,"institute": "Technical University of Munich, Germany", "instituteDE": "Technische Universität München, DE", "description": "Achieved up to 2% performance enhancement on Image AU-ROC and Pixel-AU-PRO metrics using recently (mid-2023) released Real-AD-3D dataset for anomaly detection. Implemented PointNet and PointNet++ for 3D feature extraction in a conventional descriptor-based pipeline, while integrating noising and patching techniques for local geometries. As the processed pointcouds were high-resolution, we deployed an SDF Network for a high-resolution 3D feature extraction, enhancing spatial comprehension in the feature space","descriptionDE" :"", "keywords": ["3D Computer Vision", "Deep learning"], "image": "", "url":"https://www.github.com/AbhinavUtkarsh/3D-Anomaly-Detection"},
  { "title": "Large Language Models for Structuring Radiology Reports", "team" : "Abhinav Utkarsh, Zeineb Ben Chaaben , Baris Sozudogru, Feng Dang" ,"institute": "Technical University of Munich, Germany", "instituteDE": "Technische Universität München, DE", "description": "Improved Level 1 data generation F1 score by 26% for a synthetic structured radiology report generation task, by designing a Question Answering Pipeline with handcrafted leaky prompts, essentially guiding the model to generate higher-quality structured radiology reports. At the same time, we achieved an 15x enhancement in Level 3 generations by fine-tuning (LoRA) an open source LLM (Vicuna 13B) on existing annotated ground truth. Improved Level 3 Recall by 35% from baseline with an image based visual question answering deep learning-based model Rad-Restruct by pretraining on a synthetically generated large-scale MIMIC dataset and training on annotated ground truth","descriptionDE" :"", "keywords": ["Large Language Models (LLM)", "Vicuna", "LoRA", "Rad-Restruct"], "image": "", "url":"https://collab.dvb.bayern/display/TUMmlmi/MLMI+Summer+2023?preview=/69050519/69050563/MLMI_Proposal_Report_Structuring.pdf"},
  { "title": "Autonomous Drones with ROS", "institute": "Technical University of Munich, Germany", "team" : "Milena Eisemann, Samyak Jain, Abhinav Utkarsh, Fabienne Greier, Christian Mändle" ,"instituteDE": "Technische Universität München, DE", "description": "Executed the autonomous coordination of two drones for 3D mapping within a 50×50 m² unity-based environment with ROS 1. Collaborated in a team of five, developing the navigation, perception and state machine packages while refining the PID controller gain values","descriptionDE" :"" ,"keywords": ["ROS1", "Unity", "Linux"], "image": "./images/ROS_2.png", "url":"https://www.youtube.com/watch?v=I9YYYC3NxW4&feature=youtu.be" }
]
